# Configuration de la connexion à la base de données

In [1]:
import pandas as pd 
import cx_Oracle
import sys
import os

%pylab inline
%load_ext sql

Populating the interactive namespace from numpy and matplotlib

In [2]:
sys.path.append(os.path.abspath('../../.'))
from dbconnect import utilisateur,connexion,password

# Connexion

In [3]:
%sql oracle+cx_oracle://$utilisateur:$password@$connexion

'Connected: stag01@coursdb'

# Types chaîne de caractères
## LENGTH

In [4]:
%sql SELECT LENGTH('Chaine') FROM DUAL

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[(6,)]

## VSIZE

In [5]:
%%sql  
SELECT A.TABLE_NAME,             
             B.COLUMN_NAME,
             B.DATA_TYPE, 
             B.DATA_LENGTH,
             B.DATA_PRECISION
FROM USER_TABLES A, USER_TAB_COLUMNS B
WHERE A.TABLE_NAME = B.TABLE_NAME 
  AND A.TABLE_NAME = 'CLIENTS'
ORDER BY  A.TABLE_NAME, 
          B.COLUMN_ID

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[('CLIENTS', 'CODE_CLIENT', 'CHAR', 5, None),
 ('CLIENTS', 'SOCIETE', 'NVARCHAR2', 80, None),
 ('CLIENTS', 'ADRESSE', 'NVARCHAR2', 120, None),
 ('CLIENTS', 'VILLE', 'VARCHAR2', 30, None),
 ('CLIENTS', 'CODE_POSTAL', 'VARCHAR2', 10, None),
 ('CLIENTS', 'PAYS', 'VARCHAR2', 15, None),
 ('CLIENTS', 'TELEPHONE', 'VARCHAR2', 24, None),
 ('CLIENTS', 'FAX', 'VARCHAR2', 24, None)]

In [6]:
%%sql 
SELECT 
    VSIZE(CODE_CLIENT) "TailleCODE_CLIENT", 
    LENGTH(CODE_CLIENT) "LongueurCODE_CLIENT" , 
    VSIZE(SOCIETE) "TailleSOCIETE", 
    LENGTH(SOCIETE) "LongueurSOCIETE", 
    VSIZE(VILLE) "TailleVILLE", 
    LENGTH(VILLE) "LongueurVILLE" 
FROM CLIENTS WHERE CODE_CLIENT < 'BLONP'

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[(5, 5, 38, 19, 6, 6),
 (5, 5, 68, 34, 12, 11),
 (5, 5, 46, 23, 12, 11),
 (5, 5, 30, 15, 6, 6),
 (5, 5, 36, 18, 6, 5),
 (5, 5, 46, 23, 8, 8)]

# Majuscules / Minuscules
## LOWER

In [7]:
%%sql 
SELECT NOM, LOWER(NOM) 
FROM EMPLOYES
FETCH NEXT 5 ROWS ONLY

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[('Berlioz', 'berlioz'),
 ('Nocella', 'nocella'),
 ('Herve', 'herve'),
 ('Mangeard', 'mangeard'),
 ('Cazade', 'cazade')]

## UPPER

In [8]:
%%sql 
SELECT NOM, UPPER(NOM) 
FROM EMPLOYES
FETCH NEXT 5 ROWS ONLY

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[('Berlioz', 'BERLIOZ'),
 ('Nocella', 'NOCELLA'),
 ('Herve', 'HERVE'),
 ('Mangeard', 'MANGEARD'),
 ('Cazade', 'CAZADE')]

In [9]:
%%sql 
SELECT NOM_PRODUIT, UPPER(NOM_PRODUIT) 
FROM PRODUITS 
FETCH NEXT 5 ROWS ONLY

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[('Chai', 'CHAI'),
 ('Chang', 'CHANG'),
 ('Aniseed Syrup', 'ANISEED SYRUP'),
 ("Chef Anton's Cajun Seasoning", "CHEF ANTON'S CAJUN SEASONING"),
 ("Grandma's Boysenberry Spread", "GRANDMA'S BOYSENBERRY SPREAD")]

## INITCAP

In [10]:
%%sql 
SELECT INITCAP('LE LANGE_SQL ET pL/sQL pOUR OrACLE') "Fonction INITCAP" FROM DUAL

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[('Le Lange_Sql Et Pl/Sql Pour Oracle',)]

# Manipulation de chaînes
## LPAD / RPAD

In [11]:
%%sql 
SELECT ROWNUM R, NOM, LENGTH(NOM) LN, LPAD(NOM,7,'*') L1,  LPAD(NOM,14,'&*#') L2, LPAD(PRENOM,14) L3 
FROM EMPLOYES
FETCH NEXT 5 ROWS ONLY

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[(1, 'Berlioz', 7, 'Berlioz', '&*#&*#&Berlioz', '       Jacques'),
 (2, 'Nocella', 7, 'Nocella', '&*#&*#&Nocella', '           Guy'),
 (3, 'Herve', 5, '**Herve', '&*#&*#&*#Herve', '        Didier'),
 (4, 'Mangeard', 8, 'Mangear', '&*#&*#Mangeard', '      Jocelyne'),
 (5, 'Cazade', 6, '*Cazade', '&*#&*#&*Cazade', '   Anne-Claire')]

In [12]:
%%sql 
SELECT ROWNUM R, NOM, LENGTH(NOM) LN, RPAD(NOM,7,'*') L1,  RPAD(NOM,14,'&*#') L2, RPAD(PRENOM,14) L3 
FROM EMPLOYES
FETCH NEXT 5 ROWS ONLY

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[(1, 'Berlioz', 7, 'Berlioz', 'Berlioz&*#&*#&', 'Jacques       '),
 (2, 'Nocella', 7, 'Nocella', 'Nocella&*#&*#&', 'Guy           '),
 (3, 'Herve', 5, 'Herve**', 'Herve&*#&*#&*#', 'Didier        '),
 (4, 'Mangeard', 8, 'Mangear', 'Mangeard&*#&*#', 'Jocelyne      '),
 (5, 'Cazade', 6, 'Cazade*', 'Cazade&*#&*#&*', 'Anne-Claire   ')]

## LTRIM / RTRIM

In [13]:
%%sql 
SELECT LTRIM('                Chaîne') c1,
LTRIM('***************Chaîne') c2,
LTRIM('A2BD1AC3BCD4-Chaîne', 'ABCD-1234') c3, 
RTRIM('                Chaîne                ') c4,
RTRIM('***************Chaîne***************') c5,
RTRIM('A2BD1AC3BCD4-Chaîne-A2BD1AC3BCD4', 'ABCD-1234') c6  
FROM DUAL

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[('Chaîne', '***************Chaîne', 'haîne', '                Chaîne', '***************Chaîne***************', 'A2BD1AC3BCD4-Chaîne')]

# Extraire une sous chaîne
## SUBSTR

In [14]:
%%sql 
SELECT NOM, SUBSTR(NOM,3,5)  S1, SUBSTR(NOM,3,25) S2, SUBSTR(NOM,3) S3 
FROM EMPLOYES
FETCH NEXT 5 ROWS ONLY

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[('Berlioz', 'rlioz', 'rlioz', 'rlioz'),
 ('Nocella', 'cella', 'cella', 'cella'),
 ('Herve', 'rve', 'rve', 'rve'),
 ('Mangeard', 'ngear', 'ngeard', 'ngeard'),
 ('Cazade', 'zade', 'zade', 'zade')]

## REGEXP_SUBSTR

In [15]:
%%sql 
SELECT QUANTITE, 
       REGEXP_SUBSTR(QUANTITE,'(carton|bouteilles)[^\(]') REGEXP_SUBSTR 
FROM PRODUITS 
WHERE REGEXP_LIKE(QUANTITE,'(carton|bouteilles)[^\(]')
FETCH NEXT 5 ROWS ONLY

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[('24 bouteilles (1 litre)', 'bouteilles '),
 ('12 bouteilles (550 ml)', 'bouteilles '),
 ('12 cartons (1 kg)', 'cartons'),
 ('18 cartons (500 g)', 'cartons'),
 ('1 carton (1 kg)', 'carton ')]

In [16]:
%%sql 
SELECT QUANTITE, 
       REGEXP_SUBSTR(QUANTITE,'[\(].*[\)]') REGEXP_SUBSTR 
FROM PRODUITS 
WHERE REGEXP_LIKE(QUANTITE,'[\(].*[\)]')
FETCH NEXT 5 ROWS ONLY

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[('24 bouteilles (1 litre)', '(1 litre)'),
 ('12 bouteilles (550 ml)', '(550 ml)'),
 ('48 pots (6 onces)', '(6 onces)'),
 ('12 pots (8 onces)', '(8 onces)'),
 ('12 cartons (1 kg)', '(1 kg)')]

# Recherche dans la chaîne
## INSTR

In [17]:
%%sql 
SELECT QUANTITE, 
       INSTR(QUANTITE,' ') "1", 
       INSTR(QUANTITE,' ',5,2) "2", 
       INSTR(QUANTITE,'kg', -1) "3", 
       INSTR(QUANTITE,' ', -10, 2) "4" 
FROM PRODUITS
FETCH NEXT 5 ROWS ONLY

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[('10 boîtes x 20 sacs', 3, 12, 0, 3),
 ('24 bouteilles (1 litre)', 3, 17, 0, 3),
 ('12 bouteilles (550 ml)', 3, 19, 0, 0),
 ('48 pots (6 onces)', 3, 11, 0, 3),
 ('12 pots (8 onces)', 3, 11, 0, 3)]

## REGEXP_INSTR

In [18]:
%%sql 
SELECT QUANTITE, 
       REGEXP_INSTR(QUANTITE,'\(.*\)')  "REGEXP_INSTR",
       REGEXP_SUBSTR(QUANTITE,'\(.*\)') "REGEXP_SUBSTR" 
FROM PRODUITS 
WHERE REGEXP_LIKE(QUANTITE,'\(.*\)')
FETCH NEXT 5 ROWS ONLY

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[('24 bouteilles (1 litre)', 15, '(1 litre)'),
 ('12 bouteilles (550 ml)', 15, '(550 ml)'),
 ('48 pots (6 onces)', 9, '(6 onces)'),
 ('12 pots (8 onces)', 9, '(8 onces)'),
 ('12 cartons (1 kg)', 12, '(1 kg)')]

# Rechercher et remplacer
## REPLACE

In [19]:
%%sql 
SELECT REPLACE('JACK et JUE      ','J',  '') REPLACE1,
       REPLACE('JACK et JUE      ','J','BL') REPLACE2 
FROM DUAL

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[('ACK et UE      ', 'BLACK et BLUE      ')]

## REGEXP_REPLACE

In [20]:
%%sql 
SELECT QUANTITE, 
       REGEXP_REPLACE(QUANTITE,'\(.*\).*$','--XXXXXX--')  "REGEXP_REPLACE" 
FROM PRODUITS 
WHERE REGEXP_LIKE(QUANTITE,'\(.*\)')
FETCH NEXT 5 ROWS ONLY

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[('24 bouteilles (1 litre)', '24 bouteilles --XXXXXX--'),
 ('12 bouteilles (550 ml)', '12 bouteilles --XXXXXX--'),
 ('48 pots (6 onces)', '48 pots --XXXXXX--'),
 ('12 pots (8 onces)', '12 pots --XXXXXX--'),
 ('12 cartons (1 kg)', '12 cartons --XXXXXX--')]

In [21]:
%%sql 
SELECT REGEXP_REPLACE(QUANTITE,'(\()(.*)(\))','-\1-\2-\3-') A1,
       REGEXP_REPLACE(QUANTITE,'(\()(.*)(\))','[\2]') A2, 
       REGEXP_REPLACE(QUANTITE,'(\()(.*)(\))',': \2') A3 
FROM PRODUITS WHERE REGEXP_LIKE(QUANTITE,'(cartons|pots).*\(.*\)')
FETCH NEXT 5 ROWS ONLY

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[('48 pots -(-6 onces-)-', '48 pots [6 onces]', '48 pots : 6 onces'),
 ('12 pots -(-8 onces-)-', '12 pots [8 onces]', '12 pots : 8 onces'),
 ('12 cartons -(-1 kg-)-', '12 cartons [1 kg]', '12 cartons : 1 kg'),
 ('12 pots -(-12 onces-)-', '12 pots [12 onces]', '12 pots : 12 onces'),
 ('18 cartons -(-500 g-)-', '18 cartons [500 g]', '18 cartons : 500 g')]

## TRANSLATE

In [22]:
%%sql 
SELECT NOM,
TRANSLATE(NOM,'ABCabc','12345') 
FROM EMPLOYES
FETCH NEXT 5 ROWS ONLY

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[('Berlioz', '2erlioz'),
 ('Nocella', 'Noell4'),
 ('Herve', 'Herve'),
 ('Mangeard', 'M4nge4rd'),
 ('Cazade', '34z4de')]

## ASCII

In [23]:
%sql SELECT ASCII('A') FROM DUAL

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[(65,)]

## CHR, NCHR

In [24]:
%sql SELECT CHR(65),NCHR(65),VSIZE(CHR(65)),VSIZE(NCHR(65)) FROM DUAL

 * oracle+cx_oracle://stag01:***@51.91.76.248:15440/coursdb
0 rows affected.

[('A', 'A', 1, 2)]

# Atelier 4.1	Les chaînes de caractères

## Le formatage des chaînes
Écrivez les requêtes vous permettant d’afficher :
>> * Le nom et le prénom en majuscule concaténées avec un espace au milieu. Il faut prendre soin de ne pas dépasser une longueur maximum de 14 caractères.<br>

## La manipulation des chaînes
Créez les requêtes vous permettant d’afficher :
>> * La liste des produits, type d’emballage (boîte, boîtes, pots, cartons, ...) et quantité du type d’emballage ( '36 boîtes', '12 pots (12 onces)', ...) triés par ordre alphabétique du type d’emballage.<br>